app/controllers/users_controller.rb

  def create
  	@user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "phone_number", "email", "username", "password_digest", "slug", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def show
    @user = User.friendly.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]

  def update
    @user = current_user
    if @user.update(user_params)
---
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "phone_number" = $3, "email" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["first_name", "Joesssssss"], ["last_name", "Kawaiighhhhh"], ["phone_number", "123333333"], ["email", "joekawaii@rjoestar.com"], ["updated_at", "2016-04-19 01:30:07.777135"], ["id", 7]]

  def destroy
    @user = User.friendly.find(params[:id])
    if current_user == @user
      @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 7]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 7]]

  def set_user
    user_id = params[:id] || current_user.id
    @user = User.friendly.find(user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]